# OwnerId Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalLink..::..OwnerId Property
AnalyticalLink Class See Also
---
ElementId of AnalyticalModel element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId OwnerId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OwnerId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
```

# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace